
# GradioConstants.py

TITLE = '教育大模型 v1.0'
THEME = {
    'spacing_size': 'sm',
    'radius_size': 'sm'
}
TEXTBOX_PLACEHOLDER = "在此输入您的问题"
EDU_EXAMPLES = [
    ["华中农业大学有多少学科进入了'双一流'建设学科名单？"], ['华中农业大学获得了多少项国家级教学成果奖？'],
    ['研究生一体化管理系统新的登录方式是否适用于所有师生？'],
    ['食品科学与工程专业授予的学位是什么？'],
    ['公费医疗报账需要哪些材料？'], ['国家奖学金的发放形式是什么？'],
    ['如果学生对学校处理或处分有异议，应该怎么办？ '], ['学生请假需要经过哪些步骤？'],
    ['休学、复学、退学与转学需要履行哪些程序？'], ['硕士转博士的具体流程是什么？'],
    ['毕业登记的时间安排是怎样的？'], ['华中农业大学研究生院档案室的联系电话是什么？'], ['党组织关系转接时如果系统无法成功转接怎么办？'],
    ['动物科学技术学院的研究生辅导员的联系方式是什么？'], ['获得全国大学生智能互联创新大赛一等奖可以加多少分？'],
    ['学生在‘iGEM’国际遗传工程机器设计竞赛中获得一等奖可以加多少分？'], ['"2024年暑假国内交流学习项目可以获得多少资助？?'],
    ['学生如何申请2024年暑假国内交流学习项目？'],
    ['学位论文复制比检测包括哪些部分？'], ['如果学位论文的复制比检测结果为不通过，该如何处理？'],
    ['学生考试作弊被发现后，试图销毁试卷、答卷或者考试材料，会受到什么处分？'],
    ['在哪里可以进行学籍异动和获取学籍证明？'],
    ['成绩单复印的服务在哪里提供？']
]
CROP_EXAMPLES = [
    ['适合温室栽培的玉米品种有哪些'], ['玉米是属于哪一科的植物'], ['玉米种子有几部分组成？'],
    ['适合玉米生长的温度湿度'], ['中国玉米的主要种植区域是哪里？'], ['代森锰锌主要治什么病？'],
    ['华中农业大学选育的玉米品种有哪些'], ['玉米如何烹饪'], ['如何使用玉米制作爆米花'],
    ['不同施肥处理对玉米品质的影响 '], ['干旱胁迫对玉米生长的影响'],
    ['请根据当前的基因序列，预测河北地区本作物的开花期'], ['黑糯305的生育期'],
    ['黑糯305的百粒重'], ['先玉2036的穗长'], ['先玉2036的播种时间'], ['先玉2036的播种密度'], ['云苓是什么植物'],
    ['膨大剂属于哪种植物生长调节剂？'], ['不同区域的小麦杂交育种应注意什么要点,以获得较高的产量?'],
    ['紫背天葵是什么植物'],
    ['爬山虎是什么类型的植物'], ['我打算在湖南省的黄绵土上进行有机耕作，应该选择哪些作物品种比较合适？'],
    ['请问预测接下来在云南省是否有大范围的干旱发生的可能性？'],
    ['我发现我的小麦田里有蚜虫出现，该如何处理？'],
    ['当前大豆的市场价格是多少？预计下个季度的价格走势如何？']],
SUBMIT_BTN_TEXT = '提  交'
RETRY_BTN_TEXT = '🔄重试一次'
UNDO_BTN_TEXT = '↩️撤回'
CLEAR_BTN_TEXT = '🗑️清空记录'
CONCURRENCY_LIMIT = 99